# -*- coding: utf-8 -*-

#Якщо ви бажаєте розповісти про себе - пишіть /add_bio
help_bot_text = """Якщо ви бажаєте опублікувати в нашому квазі-журналі свій творчий доробок у вигляді оповідання, розповіді або вірша - натисніть /add_text і слідуйте вказівкам.
Якщо маєте побажання щодо покращення, або скарги - скористайтеся командою /add_wish
"""
start_bot_text = """Доброго дня, ранку, вечора, ночі
Вітає квазі-літературний квазі-журнал "Квазі-Багряний Квазі-Кавун".
""" + help_bot_text + """
Примітка: Якщо бот у данну хвилину, годину, добу не відповідає, то це означає, що автор спить, або забув його запустити. Юзернейм жартівника @lrikozavr
"""
end_bot_text = 'До зустрічі!'

unknown_text_text = 'Я вас не розумію, спробуйте ще'
unknown_text_text_2 = 'Виходить якесь тотальне непорозуміння. Скористайтеся /help'
unknown_command_text = 'Цього я не знаю, спробуйте іншу команду'
unknown_command_text_2 = unknown_text_text_2
unknown_command_ultimate = 'Не хвилюйся, у тебе все вийде, пробуй ще раз (/help)'

add_text_text_start = """Добре, але треба щоб текст відповідав таким критеріям:
1. Російкою - БАННАХУЙ
2. Не повинен порушувати закони України
3. Не більше 10 граматичних помилок при перевірці на сайті ***. Звісно, пряма мова, назви і т.п. до уваги не беруться, якщо мають стилістичне навантаження.
4. Посилання на текст у форматі telgra.ph (інші види, такі як просто текст, не пройдуть фільтрацію)

Якщо ви вже підготувалися, пишіть посилання. 
В тому самому рядку, до нього можете додати коментар рецензентам щодо змісту, форми тощо, довжиною не більше ніж 2048 символи.
"""
add_text_text_error_linknotfound = 'Я не знайшов посилання у вашому повідомлені. Якщо це сталося випадково, виправте помилку та спробуйте ще.'
add_text_text_end = 'Дякую за співпрацю'
add_wish_text_start = 'Якими будуть ваші побажання?'
add_wish_text_end = add_text_text_end

group_unknown_user = 'Ви невідомий користувач, будь-ласка активуйте бота використовуючи /start'